BNNConsistency/BNNConsistency.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Studying Uncertainity in Bayesian Neural Networks</title>
<!-- 2019-07-16 Tue 14:17 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Sharan Yalburgi, Julyan Arbel" />
</head>
<body>
<div id="content">
<h1 class="title">Studying Uncertainity in Bayesian Neural Networks</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Abstract</h2>
<div class="outline-text-2" id="text-1">
<p>
Availability of uncertainity measure is the one of the major reasons why Bayesian Neural Networks are topics of interest. It is therefore essential to understand the behavior of these uncertainity measures with varying prior conditions, amount of data and modelling tasks.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
Contributions of this paper is as follows:
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Previous Work</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Study of Bayesian Neural Networks with Non-Smooth Functions \cite{NNnonsmooth}</h3>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Consistency of Posterior Distributions for Neural Networks \cite{lee2000consistency}</h3>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Classification kwith imperfect training labels \cite{cannings2018classification}</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Study effect of imperfect training labels on performance of classification methods.
</li>

<li>Bound the excess risk of an arbitrary classifier trained with imperfect labels in terms of its excess risk for predicting a noisy labe
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> A Theoretical Analysis of Deep Neural Networks for Texture Classification \cite{VC-CNN}</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Derives the upper bounds on the VC dimension of Convolutional Neural Network as well as Dropout and Dropconnect networks and the relation between excess error rate of Dropout and Dropconnect networks.
</li>

<li>Introduces concept  of Intrinsic  Dimension to  show  that  texture  datasets  have  a higher dimensionality than color/shape based data.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Understanding Priors in Bayesian Neural Networks at the Unit Level - \cite{vladimirova2019understanding}}</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Studies the "induced" prior distributions at a unit level. 
<ul class="org-ul">
<li>I layer units are Gaussian
</li>
<li>II layer units are sub-exponential
</li>
<li>Units in deeper layers are characterized by sub-Weibull distributions.
</li>
</ul>
</li>
<li>This paper is devoted to the investigation of hidden units prior distributions in Bayesian neural networks under the assumption of independent Gaussian weights.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Consistency of posterior distributions for neural networks - \cite{lee2000consistency}}</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Considers only feedforward neural networks with a single hidden layer of units with logistic activation functions(not done for popularly used ReLU activations) and linear output unit(no Sigmoid at the end).
Shows that posterior probability of feedforward neural networks is \textbf{"asymptotically consistent"}. \[ \hat{g_n} \] is asymptotically consistent for true regression function $$g_0$$ if
</p>
\begin{equation}
    \int (\hat{g_n}(x) - g_0(x))^2f_0(x)dx \xrightarrow{p} 0
\end{equation}
<p>
$$p$$ here means that the probability, 
</p>

<p>
$$P(|\int(\hat{g_n}(x) - g_0(x))^2f_0(x)dx| > \epsilon) \xrightarrow{} 0 $$ as $$n \xrightarrow{} \infty$$.
\\
\textbf{Asymptotically consistence in terms of Hellinger neighbourhood:} If $$(X_i, Y_i) ~ f_0$$, the posterior is asymptotically consistence for $$f_0$$(true joint distribution over X \&amp; Y) over Hellinger neighbourhood if for every $$\epsilon>0$$
</p>
\begin{equation}
    P({f: D_H(f,f_0) <= \epsilon}|(X_i, Y_i) \forall i) \xrightarrow{p} 1
\end{equation}
<p>
where Hellinger distance $$D_H$$ is defined as 
</p>
\begin{equation*}
    D_H(f, f_0) = \sqrt{\int\int(\sqrt{f(x, y)}-\sqrt{f_0(x, y)})^2 dx dy}
\end{equation*}
<p>
\textbf{Another approach to consistency}: Posterior probability of every neighbourhood of true function tends to 1, i.e, $$P(A_\epsilon|Y) \longrightarrow 1$$ as $$n\xrightarrow{}1$$.
\\\\
\textbf{Sieve Approach:} The number of hidden nodes grows with the sample size so that asymptotically they use arbitrarily large number of nodes.
\\\\
\textbf{Parameter Approach:} Number of hidden nodes taken as a parameter(not sure if as a hyperparameter) and show that joint posterior is also consistent.
Extends earlier results on "universal approximation properties of neural networks to the Bayesian setting".
\\\\
Shows mathematically that using a neural network to estimate and \textbf{continuous or square integrable} function will be consistent with probability tending to one given enough data. This is when the number of nodes grew with amount of data in a controlled way but $$k(n) \xrightarrow{} \infty$$ as $$n \xrightarrow{} \infty$$ where $$k$$ is the number of nodes in the network or when the number of nodes is a parameter which can be estimated from the data.    
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Theory</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Experiments</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Conclusion</h2>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Future Work</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Sharan Yalburgi, Julyan Arbel</p>
<p class="date">Created: 2019-07-16 Tue 14:17</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
